import React from 'react';

// Используем forwardRef, чтобы передать ref из App.jsx в DOM-элемент <svg>
const AnimatedLogo = React.forwardRef((props, ref) => {
  // className ("logo") будет передан из App.jsx
  return (
    <svg
      id="Слой_1"
      data-name="Слой 1"
      xmlns="http://www.w3.org/2000/svg"
      viewBox="0 0 150 190"
      ref={ref} // Прикрепляем ref здесь
      className={props.className} // Прикрепляем className здесь
    >
      <g className="robot-part">
        {/* Все части лица, КРОМЕ рта */}
        <path className="cls-1" style={{ fillRule: 'evenodd' }} d="M119.5,131.94c0,2.87,0,5.42,0,7.54,0,5.66-4.33,8.18-11.57,7.89-.94,0-2.68-.07-5-.09l-.23-6.94,10.22,0,0-8.56Zm.14-51.55-6.48.12,0-9.68-12.78,0-.23-7.06c5.78,0,10,0,11.27.12,6.43.4,8.48,4.73,8.25,10.58C119.68,75.06,119.66,77.2,119.64,80.39ZM90.46,97.58,89.11,81.89l8,.19L96.07,97.46ZM71.8,115.83l-6.66,0-1-5.77,8.42-2.51-.37-26.1,7.69.19c0,5.32-.06,20.63-.06,21.54C79.79,113,77.32,115.83,71.8,115.83Zm-17.52-19L52.42,81l8.34.2-.7,15.55ZM38,70.62,37.94,81.9,30.8,82c0-4.83.06-8.22.11-9.14.4-6.3,3.05-9.21,8.51-9,1,0,5.37,0,11.41,0l-.08,6.74Zm-.43,69.43,12.34,0-.08,7c-5,0-8.73-.06-10.23-.12-6.9-.28-9.5-4.68-9.33-10.26.07-1.9.12-4.09.16-6.49l7.2.14Z" />
        
        {/* Оригинальная улыбка */}
        <g className="smile">
          <path className="cls-1" style={{ fillRule: 'evenodd' }} d="M97.15,128.08c-11.13,7.44-30.1,8-43.32.22L57.36,123c11.22,5.45,26.07,3.27,35.53-2.32Z" />
        </g>
        
        {/* Новая ухмылка */}
        <g className="frown">
          {/* Равномерный и симметричный зигзаг */}
          <path className="cls-1" style={{ fillRule: 'evenodd' }} d="M53 130 L64 122 L75 130 L86 122 L97 130 L97 136 L86 128 L75 136 L64 128 L53 136 Z" />
        </g>
      </g>
    </svg>
  );
});

export default AnimatedLogo;
